tutorials/sonicLiquidFoam/decompressionTank/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices        
(
    (0 0 -0.1)
    (1 0 -0.1)
    (0 0.5 -0.1)
    (1 0.5 -0.1)
    (1.5 0.5 -0.1)
    (0 0.6 -0.1)
    (1 0.6 -0.1)
    (1.5 0.6 -0.1)
    (0 3 -0.1)
    (1 3 -0.1)
    (0 0 0.1)
    (1 0 0.1)
    (0 0.5 0.1)
    (1 0.5 0.1)
    (1.5 0.5 0.1)
    (0 0.6 0.1)
    (1 0.6 0.1)
    (1.5 0.6 0.1)
    (0 3 0.1)
    (1 3 0.1)
);

blocks          
(
    hex (0 1 3 2 10 11 13 12) (30 20 1) simpleGrading (1 1 1)
    hex (2 3 6 5 12 13 16 15) (30 5 1) simpleGrading (1 1 1)
    hex (3 4 7 6 13 14 17 16) (25 5 1) simpleGrading (1 1 1)
    hex (5 6 9 8 15 16 19 18) (30 95 1) simpleGrading (1 1 1)
);

edges           
(
);

patches         
(
    wall outerWall 
    (
        (0 1 11 10)
        (1 3 13 11)
        (3 4 14 13)
        (7 6 16 17)
        (6 9 19 16)
        (9 8 18 19)
    )
    symmetryPlane axis 
    (
        (0 10 12 2)
        (2 12 15 5)
        (5 15 18 8)
    )
    patch nozzle 
    (
        (4 7 17 14)
    )
    empty back 
    (
        (0 2 3 1)
        (2 5 6 3)
        (3 6 7 4)
        (5 8 9 6)
    )
    empty front 
    (
        (10 11 13 12)
        (12 13 16 15)
        (13 14 17 16)
        (15 16 19 18)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
